init.org
** Packages

Initialize package and add Melpa source

#+BEGIN_SRC emacs-lisp
(require 'package)
(let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
                    (not (gnutls-available-p))))
       (proto (if no-ssl "http" "https")))
  ;; Comment/uncomment these two lines to enable/disable MELPA and MELPA Stable as desired
  (add-to-list 'package-archives (cons "melpa" (concat proto "://melpa.org/packages/")) t)
  ;;(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)
  (when (< emacs-major-version 24)
    ;; For important compatibility libraries like cl-lib
    (add-to-list 'package-archives '("gnu" . (concat proto "://elpa.gnu.org/packages/")))))
(package-initialize)
#+END_SRC

Install use-package

#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
#+END_SRC

Install try to try packages

#+BEGIN_SRC emacs-lisp
(use-package try
  :ensure t)
#+END_SRC

Nyan mode is essential

#+BEGIN_SRC emacs-lisp
(use-package nyan-mode
  :ensure t
  :commands nyan-mode
  :config
  (nyan-mode))
#+END_SRC

Pass system shell environment to Emacs. This is important primarily for shell inside Emacs, but also things like Org mode export to Tex PDF don't work, since it relies on running external command =pdflatex=, which is loaded from =PATH=.

#+BEGIN_SRC emacs-lisp
(require 'exec-path-from-shell)
(use-package exec-path-from-shell
  :ensure t
  ;; :commands exec-path-from-shell-initialize
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))
#+END_SRC

Expand-region is great, it allows to gradually expand selection inside words, sentences, etc. =C-'= is bound to Org's =cycle through agenda files=, which I don't really use, so I unbind it here before assigning global shortcut for expansion.

#+BEGIN_SRC emacs-lisp
(require 'expand-region)
(use-package expand-region
  :ensure t
  :config
  (global-set-key (kbd "s-9") 'er/expand-region)
  (global-set-key (kbd "s-(") 'er/contract-region)
  )
#+END_SRC

Install Helm and set some keybindings. Note that I use =helm-occur= to search current buffer. (Note: here I =require= helm before using =use-package= to get rid of the warning =functions might not be defined at runtime=.

#+BEGIN_SRC emacs-lisp
(require 'helm)
(use-package helm
  :ensure t
  :config
  (require 'helm-config)
  (helm-mode 1)
  (helm-autoresize-mode 1)
  (setq helm-follow-mode-persistent t)
  (global-set-key (kbd "M-x") 'helm-M-x)
  (setq helm-M-x-fuzzy-match t)
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
  (global-set-key (kbd "s-b") 'helm-mini)
  (global-set-key (kbd "C-x C-f") 'helm-find-files)
  (global-set-key (kbd "s-f") 'helm-occur))
#+END_SRC

Install Projectile.

#+BEGIN_SRC emacs-lisp
(require 'projectile)
(use-package projectile
  :ensure t
  :config
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  (projectile-mode +1)
  )
#+END_SRC

And make Helm play nice with Projectile.

#+BEGIN_SRC emacs-lisp
(require 'helm-projectile)
(use-package helm-projectile
  :ensure t
  :config
  (helm-projectile-on))
#+END_SRC

Ag is great for fast project-wide searching. Note that =ag-helm= is only an interface. The actual Silversearcher must be installed on the OS level. See [[https://github.com/ggreer/the_silver_searcher][https://github.com/ggreer/the_silver_searcher]].

#+BEGIN_SRC emacs-lisp
(require 'helm-ag)
(use-package helm-ag
  :ensure t
  :config
  (global-set-key (kbd "s-F") 'helm-projectile-ag))
#+END_SRC

I want emacs kill ring and system clipboard to be independent. Simpleclip is the solution to that.

#+BEGIN_SRC emacs-lisp
(require 'simpleclip)
(use-package simpleclip
  :ensure t
  :commands
  (simpleclip-mode)
  :config
  (simpleclip-mode 1))
#+END_SRC

It's time for Magit!

#+BEGIN_SRC emacs-lisp
(require 'magit)
(use-package magit
  :ensure t
  :config
  (global-set-key (kbd "s-m") 'magit-status))
#+END_SRC

Emacs port of GitGutter

#+BEGIN_SRC emacs-lisp
(require 'git-gutter)
(use-package git-gutter
  :ensure t
  :config
  (global-git-gutter-mode +1)
  (custom-set-variables
   '(git-gutter:modified-sign " ") ;; two space
   '(git-gutter:added-sign "+")    ;; multiple character is OK
   '(git-gutter:deleted-sign "-"))

  (set-face-background 'git-gutter:modified "purple") ;; background color
  (set-face-foreground 'git-gutter:added "green")
  (set-face-foreground 'git-gutter:deleted "red")
  )
#+END_SRC

Beacon is a light that follows your cursor around so you don't lose it!

#+BEGIN_SRC emacs-lisp
;; (require 'beacon)
;; (use-package beacon
;;   :ensure t
;;   :config
;;   (beacon-mode 1))
#+END_SRC

Which key is great for learning Emacs, it shows a nice table of possible commands.

#+BEGIN_SRC emacs-lisp
(require 'which-key)
(use-package which-key
  :ensure t
  :config
  (which-key-mode)
  (setq which-key-idle-delay 0.6))
#+END_SRC

Spellchecking requires an external command to be available. Install =aspell= on your Mac, then make it the default checker for Emacs' =ispell=.

#+BEGIN_SRC emacs-lisp
(setq ispell-program-name "aspell")
#+END_SRC

Company autocompletion

#+BEGIN_SRC emacs-lisp
(require 'company)
(use-package company
  :ensure t
  :config
  (add-hook 'after-init-hook 'global-company-mode)

  (setq
   company-echo-truncate-lines nil
   company-dabbrev-downcase nil
   company-selection-wrap-around t
   company-transformers '(company-sort-by-occurrence
                          company-sort-by-backend-importance))

  (global-set-key (kbd "H-c") 'company-complete-common))

(use-package helm-company
  :ensure t)
#+END_SRC

Syntax checking
[[https://www.reddit.com/r/emacs/comments/7mjyz8/flycheck_syntax_checking_makes_editing_files/][Syntax checking will occur only when you save your file or change the major mode.]]

#+BEGIN_SRC emacs-lisp
(require 'flycheck)
(use-package flycheck
  :ensure t
  :init (global-flycheck-mode)
  :config
  (setq flycheck-check-syntax-automatically '(save mode-enable)))

#+END_SRC


*** Packages for programming

Terraform
#+BEGIN_SRC emacs-lisp
(require 'terraform-mode)
(use-package terraform-mode
  :ensure t)
#+END_SRC

Elixir

#+BEGIN_SRC emacs-lisp
(require 'alchemist)
(use-package alchemist
  :ensure t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'elixir-mode)
(use-package elixir-mode
  :ensure t
)
#+END_SRC

Math input

#+BEGIN_SRC emacs-lisp
(require 'xah-math-input)
(use-package xah-math-input
  :ensure t
  :config
  (global-xah-math-input-mode 0) ; turn on globally
)
#+END_SRC

Here are all the packages needed for programming languages and formats.

Yaml stuff.

#+BEGIN_SRC emacs-lisp
(use-package yaml-mode
  :ensure t)
#+END_SRC

Typescript IDE

#+BEGIN_SRC emacs-lisp
(require 'tide)
(use-package tide
  :ensure t
  :after (typescript-mode company flycheck)
  :hook ((typescript-mode . tide-setup)
         (typescript-mode . tide-hl-identifier-mode)
         (before-save . tide-format-before-save))
  :config
  (setq typescript-indent-level
        (or (plist-get (tide-tsfmt-options) ':indentSize) 2)))
#+END_SRC

Emacs client for LSPs

#+BEGIN_SRC emacs-lisp
;; (require 'eglot)
;; (use-package eglot
;;   :ensure t
;;   ;; :hook (
;;   ;;        (typescript-mode . eglot-ensure)
;;   ;;        )
;;   :config
;;   (add-to-list 'eglot-server-programs '(typescript-mode . ("typescript-language-server --stdio")))
;;   (add-hook 'typescript-mode-hook 'eglot-ensure)
;; )
#+END_SRC


Format code after safe

#+BEGIN_SRC emacs-lisp
(require 'format-all)
(use-package format-all
  :ensure t
  :config
  (global-set-key (kbd "H-f") 'format-all-buffer)
  )
#+END_SRC



** Modes

Enable some modes

#+BEGIN_SRC emacs-lisp
;; (dolist (mode
;;       '(
;;         ;; abbrev-mode                  ; E.g. sopl -> System.out.println
;;         ;; column-number-mode           ; Show column number in mode line
;;         ;; delete-selection-mode        ; Replace selected text
;;         ;; dirtrack-mode                ; directory tracking in *shell*
;;         ;; drag-stuff-global-mode       ; Drag stuff around
;;         ;; global-company-mode          ; Auto-completion everywhere
;;         ;; global-git-gutter-mode       ; Show changes latest commit
;;         global-prettify-symbols-mode ; Greek letters should look greek
;;         ;; projectile-global-mode       ; Manage and navigate projects
;;         recentf-mode                 ; Recently opened files
;;         show-paren-mode              ; Highlight matching parentheses
;;         which-key-mode))             ; Available keybindings in popup
;;   (funcall mode 1))
(recentf-mode 1)  ; Recently opened files
#+END_SRC

