init.el

(require 'package)
(let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
                    (not (gnutls-available-p))))
       (proto (if no-ssl "http" "https")))
  ;; Comment/uncomment these two lines to enable/disable MELPA and MELPA Stable as desired
  (add-to-list 'package-archives (cons "melpa" (concat proto "://melpa.org/packages/")) t)
  ;;(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)
  (when (< emacs-major-version 24)
    ;; For important compatibility libraries like cl-lib
    (add-to-list 'package-archives '("gnu" . (concat proto "://elpa.gnu.org/packages/")))))
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(use-package try
  :ensure t)

(use-package nyan-mode
  :ensure t
  :commands nyan-mode
  :config
  (nyan-mode))

;; (require 'exec-path-from-shell)
(use-package exec-path-from-shell
  :ensure t
  ;; :commands exec-path-from-shell-initialize
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

;; (require 'expand-region)
(use-package expand-region
  :ensure t
  :config
  (global-set-key (kbd "s-9") 'er/expand-region)
  (global-set-key (kbd "s-(") 'er/contract-region)
  )

;; (require 'helm)
(use-package helm
  :ensure t
  :config
  (require 'helm-config)
  (helm-mode 1)
  (helm-autoresize-mode 1)
  (setq helm-follow-mode-persistent t)
  (global-set-key (kbd "M-x") 'helm-M-x)
  (setq helm-M-x-fuzzy-match t)
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
  (global-set-key (kbd "s-b") 'helm-mini)
  (global-set-key (kbd "C-x C-f") 'helm-find-files)
  (global-set-key (kbd "s-f") 'helm-occur))

;; (require 'projectile)
(use-package projectile
  :ensure t
  :config
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  (projectile-mode +1)
  )

;; (require 'helm-projectile)
(use-package helm-projectile
  :ensure t
  :config
  (helm-projectile-on))

;; (require 'helm-ag)
(use-package helm-ag
  :ensure t
  :config
  (global-set-key (kbd "s-F") 'helm-projectile-ag))

;; (require 'simpleclip)
(use-package simpleclip
  :ensure t
  :commands
  (simpleclip-mode)
  :config
  (simpleclip-mode 1))

;; (require 'magit)
(use-package magit
  :ensure t
  :config
  (global-set-key (kbd "s-m") 'magit-status))

;; (require 'git-gutter)
(use-package git-gutter
  :ensure t
  :config
  (global-git-gutter-mode +1)
  (custom-set-variables
   '(git-gutter:modified-sign " ") ;; two space
   '(git-gutter:added-sign "+")    ;; multiple character is OK
   '(git-gutter:deleted-sign "-"))

  (set-face-background 'git-gutter:modified "purple") ;; background color
  (set-face-foreground 'git-gutter:added "green")
  (set-face-foreground 'git-gutter:deleted "red")
  )

;; (require 'beacon)
;; (use-package beacon
;;   :ensure t
;;   :config
;;   (beacon-mode 1))

;; (require 'which-key)
(use-package which-key
  :ensure t
  :config
  (which-key-mode)
  (setq which-key-idle-delay 0.6))

(setq ispell-program-name "aspell")

;; (require 'company)
(use-package company
  :ensure t
  :config
  (add-hook 'after-init-hook 'global-company-mode)

  (setq
   company-echo-truncate-lines nil
   company-dabbrev-downcase nil
   company-selection-wrap-around t
   company-transformers '(company-sort-by-occurrence
                          company-sort-by-backend-importance))

  (global-set-key (kbd "H-c") 'company-complete-common))

(use-package helm-company
  :ensure t)

;; (require 'flycheck)
(use-package flycheck
  :ensure t
  :init (global-flycheck-mode)
  :config
  (setq flycheck-check-syntax-automatically '(save mode-enable)))

;; (require 'terraform-mode)
(use-package terraform-mode
  :ensure t)

;; (require 'alchemist)
(use-package alchemist
  :ensure t)

;; (require 'elixir-mode)
(use-package elixir-mode
  :ensure t
)

;; (require 'xah-math-input)
(use-package xah-math-input
  :ensure t
  :config
  (global-xah-math-input-mode 0) ; turn on globally
)

(use-package yaml-mode
  :ensure t)

;; (require 'tide)
(use-package tide
  :ensure t
  :after (typescript-mode company flycheck)
  :hook ((typescript-mode . tide-setup)
         (typescript-mode . tide-hl-identifier-mode)
         (before-save . tide-format-before-save))
  :config
  (setq typescript-indent-level
        (or (plist-get (tide-tsfmt-options) ':indentSize) 2)))

;; (require 'eglot)
;; (use-package eglot
;;   :ensure t
;;   ;; :hook (
;;   ;;        (typescript-mode . eglot-ensure)
;;   ;;        )
;;   :config
;;   (add-to-list 'eglot-server-programs '(typescript-mode . ("typescript-language-server --stdio")))
;;   (add-hook 'typescript-mode-hook 'eglot-ensure)
;; )

;; (require 'format-all)
(use-package format-all
  :ensure t
  :config
  (global-set-key (kbd "H-f") 'format-all-buffer)
  )

;; (dolist (mode
;;       '(
;;         ;; abbrev-mode                  ; E.g. sopl -> System.out.println
;;         ;; column-number-mode           ; Show column number in mode line
;;         ;; delete-selection-mode        ; Replace selected text
;;         ;; dirtrack-mode                ; directory tracking in *shell*
;;         ;; drag-stuff-global-mode       ; Drag stuff around
;;         ;; global-company-mode          ; Auto-completion everywhere
;;         ;; global-git-gutter-mode       ; Show changes latest commit
;;         global-prettify-symbols-mode ; Greek letters should look greek
;;         ;; projectile-global-mode       ; Manage and navigate projects
;;         recentf-mode                 ; Recently opened files
;;         show-paren-mode              ; Highlight matching parentheses
;;         which-key-mode))             ; Available keybindings in popup
;;   (funcall mode 1))
(recentf-mode 1)  ; Recently opened files
