init.org
** Basic navigation and editing

AUTOMATICALLY REVERT BUFFERS

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode 1) ;; auto revert mode

(add-hook 'dired-mode-hook 'auto-revert-mode) ;; auto refresh dired when file changes
#+END_SRC


Select Text between Quotes/Brackets

#+BEGIN_SRC emacs-lisp
(defun xah-select-line ()
  "Select current line. If region is active, extend selection downward by line.
     URL `http://ergoemacs.org/emacs/modernization_mark-word.html'
     Version 2017-11-01"
  (interactive)
  (if (region-active-p)
      (progn
        (forward-line 1)
        (end-of-line))
    (progn
      (end-of-line)
      (set-mark (line-beginning-position)))))

(defun xah-select-text-in-quote ()
  "Select text between the nearest left and right delimiters.
    Delimiters here includes the following chars: \"<>(){}[]“”‘’‹›«»「」『』【】〖〗《》〈〉〔〕（）
    This command select between any bracket chars, not the inner text of a bracket. For example, if text is

     (a(b)c▮)

     the selected char is “c”, not “a(b)c”.

    URL `http://ergoemacs.org/emacs/modernization_mark-word.html'
    Version 2016-12-18"
  (interactive)
  (let (
        ($skipChars
         (if (boundp 'xah-brackets)
             (concat "^\"" xah-brackets)
           "^\"<>(){}[]“”‘’‹›«»「」『』【】〖〗《》〈〉〔〕（）"))
        $pos
        )
    (skip-chars-backward $skipChars)
    (setq $pos (point))
    (skip-chars-forward $skipChars)
    (set-mark $pos)))

(defun xah-select-block ()
  "Select the current/next block of text between blank lines.
    If region is active, extend selection downward by block.

    URL `http://ergoemacs.org/emacs/modernization_mark-word.html'
    Version 2017-11-01"
  (interactive)
  (if (region-active-p)
      (re-search-forward "\n[ \t]*\n" nil "move")
    (progn
      (skip-chars-forward " \n\t")
      (when (re-search-backward "\n[ \t]*\n" nil "move")
        (re-search-forward "\n[ \t]*\n"))
      (push-mark (point) t t)
      (re-search-forward "\n[ \t]*\n" nil "move"))))

(global-set-key (kbd "s-6") 'xah-select-block)
(global-set-key (kbd "s-7") 'xah-select-line)
(global-set-key (kbd "s-8") 'xah-select-text-in-quote)
#+END_SRC



#+BEGIN_SRC emacs-lisp
(defun xah-beginning-of-line-or-block ()
  "Move cursor to beginning of line or previous paragraph.

   • When called first time, move cursor to beginning of char in current line. (if already, move to beginning of line.)
   • When called again, move cursor backward by jumping over any sequence of whitespaces containing 2 blank lines.

   URL `http://ergoemacs.org/emacs/emacs_keybinding_design_beginning-of-line-or-block.html'
   Version 2017-05-13"
  (interactive)
  (let (($p (point)))
    (if (or (equal (point) (line-beginning-position))
            (equal last-command this-command ))
        (if (re-search-backward "\n[\t\n ]*\n+" nil "NOERROR")
            (progn
              (skip-chars-backward "\n\t ")
              (forward-char ))
          (goto-char (point-min)))
      (progn
        (back-to-indentation)
        (when (eq $p (point))
          (beginning-of-line))))))

(defun xah-end-of-line-or-block ()
  "Move cursor to end of line or next paragraph.

• When called first time, move cursor to end of line.
• When called again, move cursor forward by jumping over any sequence of whitespaces containing 2 blank lines.

URL `http://ergoemacs.org/emacs/emacs_keybinding_design_beginning-of-line-or-block.html'
Version 2017-05-30"
  (interactive)
  (if (or (equal (point) (line-end-position))
          (equal last-command this-command ))
      (progn
        (re-search-forward "\n[\t\n ]*\n+" nil "NOERROR" ))
    (end-of-line)))

(global-set-key (kbd "C-a") 'xah-beginning-of-line-or-block)
(global-set-key (kbd "C-e") 'xah-end-of-line-or-block)

#+END_SRC


Tuning GC

#+BEGIN_SRC emacs-lisp
;; reduce the frequency of garbage collection by making it happen on
;; each 50MB of allocated data (the default is on every 0.76MB)
(setq gc-cons-threshold 50000000)
#+END_SRC


[[https://emacs.stackexchange.com/questions/28736/emacs-pointcursor-movement-lag/28746][Reduce Emacs point(cursor) movement lag]]

#+BEGIN_SRC emacs-lisp
(setq auto-window-vscroll nil)
#+END_SRC

Make Fn key do Hyper. [[http://ergoemacs.org/emacs/emacs_hyper_super_keys.html][emacs_hyper_super_keys]]

#+BEGIN_SRC emacs-lisp
(setq ns-function-modifier 'hyper)
(global-set-key (kbd "H-g") (kbd "C-g"))
#+END_SRC


Kill line with =s-Backspace=, which is =Cmd+Backspace= by default. Note that thanks to Simpleclip, killing doesn't rewrite the system clipboard.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "s-<backspace>") 'kill-whole-line)
#+END_SRC

# Use =super= (which is =Cmd=) for movement and selection just like in macOS.

#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "s-<right>") (kbd "C-e"))
(global-set-key (kbd "s-<right>") 'xah-end-of-line-or-block)
(global-set-key (kbd "s-<left>") 'xah-beginning-of-line-or-block)
(global-set-key (kbd "s-<up>") (kbd "M-v"))
(global-set-key (kbd "s-<down>") (kbd "C-v"))
#+END_SRC

Brackets navigation

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "H-.") (kbd "C-M-f"))
(global-set-key (kbd "H-,") (kbd "C-M-b"))
#+END_SRC


Go to other windows easily with one keystroke =s-something= instead of =C-x something=.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "s-o") (kbd "C-x o"))
(global-set-key (kbd "s-1") (kbd "C-x 1"))
(global-set-key (kbd "s-2") (kbd "C-x 2"))
(global-set-key (kbd "s-3") (kbd "C-x 3"))
(global-set-key (kbd "s-3") (kbd "C-x 3"))
(global-set-key (kbd "s-0") (kbd "C-x 0"))
(global-set-key (kbd "s-w") (kbd "C-x 0"))
(global-set-key (kbd "s-t") (kbd "C-x 3"))
#+END_SRC

Smarter open-line by [[http://emacsredux.com/blog/2013/03/26/smarter-open-line/][bbatsov]]. Once again, I'm taking advantage of CMD and using it to quickly insert new lines above or below the current line, with correct indentation and stuff.

#+BEGIN_SRC emacs-lisp
(defun smart-open-line ()
  "Insert an empty line after the current line. Position the cursor at its beginning, according to the current mode."
  (interactive)
  (move-end-of-line nil)
  (newline-and-indent))

(defun smart-open-line-above ()
  "Insert an empty line above the current line. Position the cursor at it's beginning, according to the current mode."
  (interactive)
  (move-beginning-of-line nil)
  (newline-and-indent)
  (forward-line -1)
  (indent-according-to-mode))

;; (global-set-key (kbd "s-<return>") 'smart-open-line)
;; (global-set-key (kbd "s-S-<return>") 'smart-open-line-above)
;; (global-unset-key (kbd "s-<return>"))
;; (global-unset-key (kbd "s-S-<return>"))
#+END_SRC

Delete trailing spaces and add new line in the end of a file on save.

#+BEGIN_SRC emacs-lisp
(add-hook 'before-save-hook 'delete-trailing-whitespace)
(setq require-final-newline t)
#+END_SRC

Auto close bracket insertion. And make electric-pair-mode work on more brackets.

#+BEGIN_SRC emacs-lisp
(electric-pair-mode 1)
(setq electric-pair-pairs '(
                            (?\" . ?\")
                            (?\{ . ?\})
                            ) )
#+END_SRC

multiple-cursors

#+BEGIN_SRC emacs-lisp
(use-package multiple-cursors
  :ensure t
  :config
  (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines) ; When you have an active region that spans multiple lines, the following will add a cursor to each line
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
  )
#+END_SRC


