init.el

(setq org-directory "~/Dropbox/org/")

(setq org-agenda-files '("~/Dropbox/org/"))

(setq org-support-shift-select t)

(eval-after-load 'org
  '(progn
     (add-to-list 'org-structure-template-alist
                  '("el" "#+BEGIN_SRC emacs-lisp \n?\n#+END_SRC")
                  '("ts" "#+BEGIN_SRC typescript \n?\n#+END_SRC"))
     (define-key org-mode-map (kbd "C-'") nil)
     (global-set-key "\C-ca" 'org-agenda)
     (global-set-key "\C-c l" 'org-agenda)
     ))

;; (org-indent-mode 1)

(setq org-edit-src-content-indentation 0)
(setq org-src-tab-acts-natively t)
(setq org-src-preserve-indentation t)

(setq org-src-fontify-natively t)

(custom-set-variables
 '(org-export-backends (quote (ascii html icalendar latex md odt))))

(find-file "~/Dropbox/org/main.org")

(setq org-log-into-drawer t)

(global-set-key (kbd "\e\em") (lambda () (interactive) (find-file "~/Dropbox/org/main.org")))
(global-set-key (kbd "\e\ec") (lambda () (interactive) (find-file "~/.emacs.d/init.org")))
(global-set-key (kbd "\e\el") (lambda () (interactive) (find-file "~/Dropbox/org/links.org")))

(setq org-cycle-separator-lines 1)

;; (require 'org-bullets)
(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
